Repository: GSG-Robots/spike-prime-code
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: de

source: Add a file in the ``runs`` folder. The order of appereance in the menu is alphabetically by the filename.
de: Füge eine Datei zum ``runs`` Ordner hinzu. Die Reihenfolge der Anzeige im Menu erfolgt alphabetisch nach Dateinamen.

source: The file should look like this:
de: Die Satei sollte wiefolgt aussehen:

source: Contents:
de: Inhalt:

source: Usage
de: Nutzung

source: Controlling Attachments
de: Steuern von Attachments

source: Even though you are probably be here to look up one specific thing, you might profit of reading the hole page from the beginning, as you will need the knowledge gained in the upper paragraphs when reading the ones further down.
de: Auch wenn du nur hier bist um eine spezielle Sache nachzugucken, kann es Sinn machen, die ganze Seite zu lesen, da die unteren Abschnitte vorraussetzen, dass du die vorhergehenden Abschnitte verstanden hast.

source: When speaking about the robot, we name the hole thing you can swap out on the robot "attachment". However, when coding, an "attachment" simply refers to one of the output gears of the gearbox.
de: Wenn wir über den Roboter reden, nennen wir die gesamte Anbaute "Attachment". Wenn wir allerdings Programmieren, bezeichnet "Attachment" einen der Zahnrad-Anschlüsse, der in Anbauten verwendet wird.

source: The two most important things when controlling attachments are the attachment functions in the :py:mod:`gsgr.movement` module and the :py:class:`~gsgr.enums.Attachment` enum.
de: Die zweich wichtigsten Dinge für das Steuern sind die Funktionen des :py:mod:`gsgr.movement` Moduls und das :py:class:`~gsgr.enums.Attachment` enum.

source: Holding an attachment in place
de: Ein Attachment an der Stelle festhalten

source: We will begin with the :py:func:`~gsgr.movement.hold_attachment` function, as it is the easiest one to understand. Here is an example code block:
de: Wir beginnen mit der Funktion :py:func:`~gsgr.movement.hold_attachment`, da sie am einfachsten zu verstehen ist. Hier is ein Beispiel:

source: The :py:func:`~gsgr.movement.hold_attachment` functions is given the information which attachment to select using the gear selector. The enum :py:class:`~gsgr.enums.Attachment` serves as a place to store the arbitrary numbers which are asociated with the output gears in relation to names like :py:attr:`~gsgr.enums.Attachment.FRONT_LEFT` or :py:attr:`~gsgr.enums.Attachment.BACK_RIGHT`.
de: Die Funktion :py:func:`~gsgr.movement.hold_attachment` wird mit der Information, welches Attachment mit dem "gear selector" ausgewählt werden soll, aufgerufen. Das enum :py:class:`~gsgr.enums.Attachment` stellt lediglich einen Weg dar, die unspezifischen Zahlen, welche mit den verschiedenen Ausgängen in Verbindung gebracht werden, mithilfe von sinvollen Namen zu wie :py:attr:`~gsgr.enums.Attachment.FRONT_LEFT` oder :py:attr:`~gsgr.enums.Attachment.BACK_RIGHT` speichern und zu nutzen.

source: The example code will simply select the front left gear, so it is no songer freely movable. This can be useful for arms that should not fall or other things that should be held in place.
de: In diesem Beispiel wird einfach nur der vordere, linke Ausgang angesteuert, sodass er nicht mehr frei bewegt werden kann. Das kann zum Beispiel nützlich sein, wenn ein aufrechter Arm in seiner Position gehalten werden soll, während der Roboter fährt.

source: Allowing an attachment to move freely
de: Einem Attachment ermöglichen, sich frei zu bewegen

source: This is a very similar thing, so most of it can be explained with a simple code example, altough there are a few special cases which are handled below the example:
de: Das ist sehr ähnlich, also kann es größtenteils mit einem einfachen Code-Beispiel erklärt werden, obwohl es ein paar spezielle Fälle gibt, welche wir weiter unten behandeln.

source: This code will allow the attachment in the front left to move freely. But you have to be cautionous! This code has a side effect that is not visible at first glance: It blocks one of the other attachments. This is because the gearbox only has 4 stable/safe states and we try to move out of the way as far as possible to ensure the front left attachment can really move freely.
de: Dieser Code erlaubt es dem attachment vorne links, sich frei zu bewegen. Aber Vorsicht! Dieser Code hat einen Effekt, der nicht direkt sichtbar ist: Er blockiert einen der anderen Ausgänge. Das liegt daran, dass das Getriebe nur vier stabiele bzw. sichere Positionen hat, und wir versuchen, es so einzustellen, das der angegebene Ausgang sicher frei ist.

source: If you want to ensure multiple attachments are freed at the same time, you can simply select one of the left over attachments using :py:func:`~gsgr.movement.hold_attachment`.
de: Wenn man mehreren Attachments gleichzeitig ermöglichen möchte, sich zu bewegen, kann man einfach einen der Ausgänge ansteuern, der sich nich frei bewegen können muss.Dazu kann wieder :py:func:`~gsgr.movement.hold_attachment`. verwendet werden.

source: If you, for some unknown reasons, want to "unselect" all attachments at the same time, you can use the (unsafe!) :py:func:`~gsgr.movement.free_attachments` function, which turns the gear selector at a 45° angle so none of the attachments is selected. This is possible, but because being just 5° off will already paritally block one of the attachments, this will not always work and is discouraged.
de: Wenn man, aus welchen Gründen auch immer, freie Bewegung an allen Ausgängen gleichzeitig ermöglichen will, kann man die (unsichere!) Funktion :py:func:`~gsgr.movement.free_attachments` nutzen, welche den "gear selector" auf eine 45° Position genau zwischen zwei Ausgängen stellt. Das ist möglich, wegen der dazu Benötigten aber nicht vorhandenen Genauigkeit des Motors aber nicht immer funktional und sollte eher nicht verwendet werden.

source: Move an attachment
de: Bewegen eines Attachments

source: Finally, to move an attachment, you can use the :py:func:`~gsgr.movement.run_attachment` function.
de: Um ein Attachment zu bewegen, kann die :py:func:`~gsgr.movement.run_attachment` Funktion verwendet werden.

source: Parameters you have to supply are:
de: Parameter, die angegeben werden müssen, sind:

source: The attachment to move
de: Das zu bewegende Attachment

source: The speed to move it at
de: Die Geschwindigkeit

source: The duration to move it for
de: Die Dauer, wie lange es bewegt werden soll.

source: This can look like this:
de: Das kann so aussehen:
